; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem prb-167_d21_p-TR3-n26-r1w5o6c9-4) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 - Rover
	rover0store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 - Waypoint
	camera0 camera1 camera2 camera3 camera4 camera5 camera6 camera7 camera8 - Camera
	objective0 objective1 objective2 objective3 objective4 objective5 - Objective
	)
(:init
(visible waypoint0 waypoint1)
(visible waypoint1 waypoint0)
(visible waypoint1 waypoint3)
(visible waypoint3 waypoint1)
(visible waypoint2 waypoint0)
(visible waypoint0 waypoint2)
(visible waypoint2 waypoint3)
(visible waypoint3 waypoint2)
(visible waypoint2 waypoint4)
(visible waypoint4 waypoint2)
(visible waypoint3 waypoint0)
(visible waypoint0 waypoint3)
(visible waypoint3 waypoint4)
(visible waypoint4 waypoint3)
(visible waypoint4 waypoint0)
(visible waypoint0 waypoint4)
(visible waypoint4 waypoint1)
(visible waypoint1 waypoint4)
(at_lander general waypoint4)
(store_of rover0store rover0)
(equipped_for_rock_analysis rover0)
(equipped_for_imaging rover0)
(can_traverse rover0 waypoint4 waypoint0)
(can_traverse rover0 waypoint0 waypoint4)
(can_traverse rover0 waypoint4 waypoint2)
(can_traverse rover0 waypoint2 waypoint4)
(can_traverse rover0 waypoint4 waypoint3)
(can_traverse rover0 waypoint3 waypoint4)
(can_traverse rover0 waypoint0 waypoint1)
(can_traverse rover0 waypoint1 waypoint0)
(on_board camera0 rover0)
(calibration_target camera0 objective5)
(supports camera0 low_res)
(on_board camera1 rover0)
(calibration_target camera1 objective5)
(supports camera1 low_res)
(on_board camera2 rover0)
(calibration_target camera2 objective1)
(supports camera2 high_res)
(supports camera2 low_res)
(on_board camera3 rover0)
(calibration_target camera3 objective5)
(supports camera3 colour)
(supports camera3 low_res)
(on_board camera4 rover0)
(calibration_target camera4 objective3)
(supports camera4 high_res)
(supports camera4 low_res)
(on_board camera5 rover0)
(calibration_target camera5 objective1)
(supports camera5 high_res)
(on_board camera6 rover0)
(calibration_target camera6 objective5)
(supports camera6 colour)
(supports camera6 low_res)
(on_board camera7 rover0)
(calibration_target camera7 objective5)
(supports camera7 high_res)
(on_board camera8 rover0)
(calibration_target camera8 objective4)
(supports camera8 colour)
(supports camera8 low_res)
(visible_from objective0 waypoint1)
(visible_from objective0 waypoint2)
(visible_from objective1 waypoint0)
(visible_from objective1 waypoint1)
(visible_from objective1 waypoint2)
(visible_from objective2 waypoint2)
(visible_from objective2 waypoint3)
(visible_from objective3 waypoint0)
(visible_from objective4 waypoint0)
(visible_from objective4 waypoint1)
(visible_from objective4 waypoint2)
(visible_from objective5 waypoint0)
(visible_from objective5 waypoint1)
(visible_from objective5 waypoint2)
(at_soil_sample waypoint0)
(at_rock_sample waypoint0)
(at_soil_sample waypoint1)
(at_rock_sample waypoint1)
(at_soil_sample waypoint2)
(at_rock_sample waypoint2)
(at_rock_sample waypoint3)
(channel_free general)
(available rover0)
(empty rover0store)
(at rover0 waypoint2)
(calibrated camera7 rover0)
)

(:goal (and
(communicated_rock_data waypoint0)
(communicated_rock_data waypoint2)
(communicated_image_data objective4 low_res)
(communicated_image_data objective2 high_res)
(communicated_image_data objective2 colour)
(communicated_image_data objective5 high_res)
(communicated_image_data objective0 low_res)
	)
)
)

; plan
1. (calibrate rover0 camera8 objective4 waypoint2)
   added: (calibrated camera8 rover0)
   goals met: 0 of 7
2. (take_image rover0 waypoint2 objective0 camera8 low_res)
   deleted: (calibrated camera8 rover0)
   added: (have_image rover0 objective0 low_res)
   goals met: 0 of 7
3. (calibrate rover0 camera8 objective4 waypoint2)
   added: (calibrated camera8 rover0)
   goals met: 0 of 7
4. (communicate_image_data rover0 general objective0 low_res waypoint2 waypoint4)
   added: (communicated_image_data objective0 low_res)
   goals met: 1 of 7
5. (take_image rover0 waypoint2 objective2 camera8 colour)
   deleted: (calibrated camera8 rover0)
   added: (have_image rover0 objective2 colour)
   goals met: 1 of 7
6. (calibrate rover0 camera8 objective4 waypoint2)
   added: (calibrated camera8 rover0)
   goals met: 1 of 7
7. (take_image rover0 waypoint2 objective4 camera8 low_res)
   deleted: (calibrated camera8 rover0)
   added: (have_image rover0 objective4 low_res)
   goals met: 1 of 7
8. (communicate_image_data rover0 general objective2 colour waypoint2 waypoint4)
   added: (communicated_image_data objective2 colour)
   goals met: 2 of 7
9. (communicate_image_data rover0 general objective4 low_res waypoint2 waypoint4)
   added: (communicated_image_data objective4 low_res)
   goals met: 3 of 7
10. (take_image rover0 waypoint2 objective2 camera7 high_res)
   deleted: (calibrated camera7 rover0)
   added: (have_image rover0 objective2 high_res)
   goals met: 3 of 7
11. (calibrate rover0 camera7 objective5 waypoint2)
   added: (calibrated camera7 rover0)
   goals met: 3 of 7
12. (take_image rover0 waypoint2 objective5 camera7 high_res)
   deleted: (calibrated camera7 rover0)
   added: (have_image rover0 objective5 high_res)
   goals met: 3 of 7
13. (communicate_image_data rover0 general objective5 high_res waypoint2 waypoint4)
   added: (communicated_image_data objective5 high_res)
   goals met: 4 of 7
14. (communicate_image_data rover0 general objective2 high_res waypoint2 waypoint4)
   added: (communicated_image_data objective2 high_res)
   goals met: 5 of 7
15. (sample_rock rover0 rover0store waypoint2)
   deleted: (empty rover0store) (at_rock_sample waypoint2)
   added: (have_rock_analysis rover0 waypoint2) (full rover0store)
   goals met: 5 of 7
16. (communicate_rock_data rover0 general waypoint2 waypoint2 waypoint4)
   added: (communicated_rock_data waypoint2)
   goals met: 6 of 7
17. (navigate rover0 waypoint2 waypoint4)
   deleted: (at rover0 waypoint2)
   added: (at rover0 waypoint4)
   goals met: 6 of 7
18. (navigate rover0 waypoint4 waypoint0)
   deleted: (at rover0 waypoint4)
   added: (at rover0 waypoint0)
   goals met: 6 of 7
19. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 6 of 7
20. (sample_rock rover0 rover0store waypoint0)
   deleted: (empty rover0store) (at_rock_sample waypoint0)
   added: (have_rock_analysis rover0 waypoint0) (full rover0store)
   goals met: 6 of 7
21. (communicate_rock_data rover0 general waypoint0 waypoint0 waypoint4)
   added: (communicated_rock_data waypoint0)
   goals met: 7 of 7
